{"review_id":"VfBHSwC5Vz_pbFluy07i9Q","user_id":"cjpdDjZyprfyDG3RlkVG3w","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":5,"date":"2016-07-12","text":"My girlfriend and I stayed here for 3 nights and loved it. The location of this hotel and very decent price makes this an amazing deal. When you walk out the front door Scott Monument and Princes street are right in front of you, Edinburgh Castle and the Royal Mile is a 2 minute walk via a close right around the corner, and there are so many hidden gems nearby including Calton Hill and the newly opened Arches that made this location incredible.\n\nThe hotel itself was also very nice with a reasonably priced bar, very considerate staff, and small but comfortable rooms with excellent bathrooms and showers. Only two minor complaints are no telephones in room for room service (not a huge deal for us) and no AC in the room, but they have huge windows which can be fully opened. The staff were incredible though, letting us borrow umbrellas for the rain, giving us maps and directions, and also when we had lost our only UK adapter for charging our phones gave us a very fancy one for free.\n\nI would highly recommend this hotel to friends, and when I return to Edinburgh (which I most definitely will) I will be staying here without any hesitation.","useful":0,"funny":0,"cool":0}
{"review_id":"3zRpneRKDsOPq92tq7ybAA","user_id":"bjTcT8Ty4cJZhEOEo01FGA","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":3,"date":"2016-10-02","text":"If you need an inexpensive place to stay for a night or two then you may consider this place but for a longer stay I'd recommend somewhere with better amenities. \n\nPros:\nGreat location- you're right by the train station, central location to get to old town and new town, and right by sight seeing his tours. Food, bars, and shopping all within walking distance. Location, location, location.\nVery clean and very good maid service\n\nCons:\nTiny rooms \nUncomfortable bed \nAbsolutely no amenities \nNo phone in room \nNo wardrobe \n\nWas given a lot of attitude about me and my husband sharing a room which was quite strange and we were charged 15 pounds more for double occupancy not sure why that matters I felt like it was a money grab. It was just handled in a kind of odd manner to me... \n\nIf you book this hotel all you get is a bed, desk, and a bathroom. It isn't awful but know what you're getting into.","useful":0,"funny":0,"cool":0}
{"review_id":"ne5WhI1jUFOcRn-b-gAzHA","user_id":"AXgRULmWcME7J6Ix3I--ww","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":3,"date":"2015-09-17","text":"Mittlerweile gibt es in Edinburgh zwei Ableger der Motel-One-Kette - diese hier ist eher das schlechtere.\n\nWir hatten auf unserer Schottlandtour die Gelegenheit beide Ableger kennenzulernen, da wir beide Nächte in Edinburgh (am ersten sowie am letzten Tag) in einem der beiden Motel One's verbrachten. Von diesem hier waren wir nach dem überraschend positiven Erlebnis im Motel One an der Princes Street [1] etwas enttäuscht.\n\nDas Hotel ist wesentlich größer und extrem unübersichtlich. Da man auf der fünften Etage noch Teile eines weiteren Gebäude, das mittels einer Glasbrücke mit dem Hauptgebäude verbunden ist, hinzugenommen hat, kann die Suche nach dem Zimmer insbesondere auf dieser Etage zu einem Gang im Labyrinth ausarten. Habe ich so noch in keinem Hotel erlebt - uns begegneten immer wieder Menschen, die sich auf der Suche nach ihren Zimmern verirrt haben.\nUnser Zimmer war ähnlich aufgebaut wie das Zimmer im Motel One Princes Street - befand sich jedoch im Inneren des Gebäudes und hatte daher kein Fenster. Nur eine kleine Dachluke, die sich am oberen Ende eines etwa 3m langen Schachts befand, sorgte für einen minimalen Anteil Tageslicht im Zimmer. diese Luke ließ sich auch nicht öffnen, nur ein elektrisches Rollo ließ sich mittels eines Schalters öffnen bzw. schließen.\nSonst gilt für das Zimmer eigentlich das Gleiche wie für das Zimmer im im Motel One Princes Street: Relativ klein, trotzdem extrem ansprechend und schick gestaltet und clever durchdacht. Dazu sehr ruhig.\n\nIm gesamten Hotel gibt es kostenloses WLAN für die Dauer des Aufenthalts für maximal 3 Geräte.\n\nDie Lage des Motel One Royal Mile ist großartig. Vom Airlink-Flughafenbus kann man quasi in den Hoteleingang stolpern, es sind maximal 50m. Zur Royal Mile sind es etwa 100m Luftlinie (bergauf) und man benötigt etwa 5 Minuten bis dort.\n\nDas Frühstück für 9,50 GBP \/ Person kann man nutzen - muss man aber nicht. Es ist eher übersichtlich und kontinetaler Prägung, trotzdem aber sehr gut. Für den gleichen Preis oder weniger bekommt man aber problemlos ein reichhaltiges Frühstück in einem der zahlreichen Cafes von Edinburgh.\n\nFür ein oder zwei Nächte kann man hier problemlos bleiben, sollte aber nicht allzuviel erwarten. Hat man die Wahl, sollte man meiner Erfahrung nach lieber auf das andere Motel One an der Princes Street ausweichen. \n\n\n----\n[1] http:\/\/www.yelp.de\/biz\/motel-one-edinburgh-2?hrid=7UDwl3s_DuOokkGPZXZgBw","useful":0,"funny":0,"cool":0}
{"review_id":"llmdwOgDReucVoWEry61Lw","user_id":"oU2SSOmsp_A8JYI7Z2JJ5w","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":4,"date":"2016-08-21","text":"Location is everything and this hotel has it! The reception is inviting and open 24 hours. They are very helpful and have a lot of patience answering all my questions about where to go etc. there is also a lounge open 24 hours with snack-type food. Breakfast is continental-style so if you want heartier fare look elsewhere though you don't have to go far. The bus and train stations are right across the street so it's easy access to the airport or anywhere else you may want to go. Turn uphill to old town or cross the bridge to new town. The room with a view i got was spacious and comfortable though it's a bit of a maze to find it-just follow the signs. The windows are double paned so the room is quiet plus i was on the 5th floor which helps. It's a bit pricey but still one of the best values i found!","useful":0,"funny":0,"cool":0}
{"review_id":"DuffS87NaSMDmIfluvT83g","user_id":"0xtbPEna2Kei11vsU-U2Mw","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":5,"date":"2013-11-20","text":"gute lage im stadtzentrum. shoppingmeile und sehenswürdigkeiten, sowie gute pubs in laufweite. das hotel ist neu, gut gepflegt und hat bemühtes\/nettes personal. ideal für einen kurztrip nach edinburgh. längere aufenthalte eher nicht, da die zimmer recht klein sind.","useful":0,"funny":0,"cool":0}
{"review_id":"GvLmUkjUrOyFH8KFnmT1uw","user_id":"rW8q706dz5-NnXDzMwVkiw","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":5,"date":"2016-06-05","text":"Erstklassige Lage. Dazu ist alles geschrieben  worden.\nWir hatten Zimmer 718 mit Blick auf den Bahnhof. Ist zwar zu laut mit offenen Fenster nachts, aber der Ausblick verzeiht alles. Das Personal ist sehr freundlich und super hilfsbereit. Wer Edinburgh zu Fuß erkunden möchte, ist hier perfekt aufgehoben.","useful":0,"funny":0,"cool":0}
{"review_id":"lGEl24NGj2HVBJrodeXcjg","user_id":"yx8vNXUL0D0HS8rUIC7AFA","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":4,"date":"2015-02-21","text":"Beautiful space, great location, staff rock. Tiny room, but this was expected. Bathroom amazing. Walls, however, paper thin, which is why I can barely string a sentence together in this review.","useful":0,"funny":0,"cool":0}
{"review_id":"cUgvEy5wj7zYE68v1BzzVg","user_id":"zXnH6W74FAJQ7q7b-NuBsA","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":4,"date":"2013-07-07","text":"This is a fairly new property I think. It is a German company and has most of the amenities you would want. It is priced on the budget minded side so it won't break your bank.\nLocation is really good. Near the Royal Mile and Waverley station without being too noisy. Very easy to walk to everything we wanted to do. Has WiFi but we did have to re-log in every day.","useful":0,"funny":0,"cool":0}
{"review_id":"FSB_BnvysBgH3JYrbFNcgw","user_id":"c5yp5hxwC1N98MjbV2LyWQ","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":4,"date":"2013-04-27","text":"First time at this group of hotels. Pretty new, only one in UK, another to open in Edinburgh and one in London. Rooms not very big but great price and location for a weekend in Edinburgh. Rooms clean, comfortable, good shower and free wifi!","useful":2,"funny":0,"cool":2}
{"review_id":"dhl3ZW9aAEX_T7_um5tfaQ","user_id":"xJisL5w4wOgiYLokGMT_IA","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":4,"date":"2015-04-13","text":"Location location location! \n\nMotel One is just right in the middle of everything. To one side you have the New town and the main trains station ( and right in front of the airport bus)  and on the other side the beautiful old town of Edinburg. \n\nThe room was small but clean and with all you need. \nThe bathroom was also small but nice and clean and the shower was big and good! Next to the bed there is a European plug (CC 7\/7) so we actually didn't need to use our adapter. \n\nThe beed was to hard for my back and I prefer the bed more soft, but I will still come back to Edinburgh and Motel One.","useful":2,"funny":0,"cool":0}
{"review_id":"JQJvnM3p-3eML05eKcTgiw","user_id":"tgV6tsYQ66DZ3LQKvtC6cw","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":4,"date":"2016-11-08","text":"A hotel that has all the basics that you'd need - no additional fuss. For the price we paid, I'd say this place is actually pretty good value. The location is super central and it's easy to get to everywhere from here! It's also right next to the airport shuttle bus and train station, so transport is also easy. \n\nThe insides is a bit of a maze depending on where your room is located - you may have to go down to go up to go back down again to get to your room! But no bother, it's good for walking off the chips and sobering from your drinks.","useful":1,"funny":1,"cool":1}
{"review_id":"6JF4WfHgwYrrdZ2VeYtnFw","user_id":"Q-3YCVywc03w56wYtGlKvg","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":3,"date":"2015-07-27","text":"Stayed here for two nights, costs was £109 per night for two people sharing a room which was not a budget price for what felt like budget rooms. Firstly they don't have any twin rooms in the hotel which would be preferable when I was sharing with a friend not my lover! There is only one small bin which is located in the bathroom.  No soap, which I find ridiculous, only toiletries were a dual shower gel\/hair wash. There was a hairdryer but no wardrobes or drawers. Room was also very cold. \n\nNow for the positive, the location is very good, close to princes street and St. Andrews square. The staff are very helpful and the bar is 24 hours. \n\nDon't bother with the breakfast which is £9.50 each for a continental breakfast where you can easily get a cooked breakfast in any one of the cafes in Cockburn Street, which is adjacent to this hotel. \n\nIf I go to Edinburgh again I will book a different hotel.","useful":1,"funny":0,"cool":0}
{"review_id":"fbVYETRuWDw8QnpimpGMpg","user_id":"Cx4UCow0zQgFQOp47RRRaA","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":4,"date":"2014-05-07","text":"Well, i like the idea of Motel One. Always in the center of the city, somehow modern design, good beds. No fancy unnecessary stuff. All of this is true for this motel one in Edinburgh. Perfectly located even if it's hard to discover. \nBreakfast is ok, but not more. \nService is friendly. \nNo twin rooms available..","useful":1,"funny":0,"cool":0}
{"review_id":"lobj38NgaokqVseN8_nn6g","user_id":"eqWEgMH-DCP74i82BEAZzw","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":4,"date":"2015-02-26","text":"I really do love the Germans. This chain is spreading fast over there and they're bringing their efficiency and attention to detail with them here. \n\nMotel One is, as the name suggests, aimed at the budget market. Rates for this venue range from approximately £69\/night up. I booked ahead and appreciated the completely free reservation process with room guaranteed until 6pm on the day of arrival. If you give your credit card details, it's reserved beyond that time.\n\nLocation is excellent! If you exit from the Market St side of Waverly and turn right it's maybe 3 minutes away. It would be very hard to have it closer. That also makes it very close to the castle and Princes St. Welcome was warm and check-in easy. The lobby area is pretty small but clean and cosy with sweets, maps etc. There's a bar area down a few steps where they also serve the buffet breakfast each morning.\n\nMy room was the cheapest version and was internal, facing onto a courtyard. It had no view and was quite dark, but quiet. Everything was completely spotless. The bathroom was small but well designed and had a great shower. Bed was comfy with 2 single duvets. So continental, don't you know? I appreciated the tea and coffee making facilities (I'm like a beast without them), the decent sized TV and the free wifi. The hanging storage facilities are limited but it was fine for a few days. \n\nRandom: hands down the best hotel hairdryer I have ever used. And one of the best dryers in general-called a Black Mambo. It was worth staying there for that alone. Well, you know, also the really good value and the pristine conditions. But definitely the hairdryer.","useful":1,"funny":0,"cool":0}
{"review_id":"ysfjtAWreLoy7um8WTb8xA","user_id":"d0DGZRp6lHXGECJSc_nn-A","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":5,"date":"2015-08-21","text":"Motel One sets the standard for budget hotels. I stayed at the Dusseldorf branch a while ago so when I saw one in Edinburgh, I knew this was the place to book. We managed to get a reservation during the Edinburgh Fringe Festival and only booked a few weeks before. We did pay a premium over the normal rate but given the crowds in the city during this time, it was still a good deal compared to other hotels.\n\nStaff were all friendly and welcoming, presentable and professional.\nWe received a room upgrade with quite a large room overlooking the bridge crossing Waverley station to Princes St. Despite overlooking a busy road, the room was almost silent thanks to solid double glazing. The room temperature was perfectly controlled with an individual A\/C unit. Super clean, modern, uncluttered. Bathroom was similar. No slamming doors or noise in the night. Bonus.\n\nFree wifi that works with one log in (doesn't require repeated log ins as some places do) and had decent signal strength.\n\nThe buffet continental breakfast was also a hit with fresh croissants, danishes, cold cuts, cheese, toast, fruit and yoghurt all well presented, fresh and good quality as was the coffee.\n\nIf I am looking for a reasonable hotel in a city, Motel One will be by first choice.","useful":1,"funny":0,"cool":1}
{"review_id":"OF1ToqGAubsWGri5iad15w","user_id":"IpLZ7RevQrFPJWYc9Gxymg","business_id":"uYHaNptLzDLoV_JZ_MuzUA","stars":3,"date":"2013-12-07","text":"Had Continental style breakfast here a short distance from Waverley Station as I had half hour before a train home and wanted to try somewhere new. Motel1One is nearby and a easy two minute walk, slightly uphill towards the castle from the station. \n\nOn entry it's modern, cosy has tons of cool yet bright pastel and mochilato colours to accommodate your cold wintertime self. Wooden floors, warm rugs, sheepskins on the sofas, slate walls and oak barrelled tables, with slight distinct Scottish themes due to their tartan furnished accessories completes the feel.\n\nI sat in One Lounge, had tea and food self served for well under £10, you know bran, meats cheese and croissant that sort of stuff. With a copy of local newspaper in hand I really needed to eat, stay warm and access wifi, the reasons I came in.\n\nSome hotels in the city give you access to wifi if your a paying guest, but repeated attempts to access their wifi even with staff help, eventually gave access but in German. On going to reception again for additional help the staff were great got the correct website for me, but still no luck.\n\nHmmm, by the time this was all done I came back to cold tea and didn't really have time now to finish a second cup of hot Earl Grey, so sorry to staff for removing an almost full cup of tea. Great place though nice breakfast and funky decor especially the plasma tv displaying a roasting log fire in reception, but sadly for me no easy access to wifi when badly required.\n\nMaybe next time I will endeavour to try food against technology!","useful":1,"funny":0,"cool":0}
{"review_id":"ByRzJ8rF2KJWLr-cUNU6EA","user_id":"kzyLOqiJvyw_FWFTw2rjiQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2017-06-03","text":"This place is horrible, we were so excited to try it since I got a gift card for my birthday. We went in an ordered are whole meal and they did not except are gift card, because their system was down. Unacceptable, this would have been so helpful if we would have known this prior!!","useful":0,"funny":0,"cool":0}
{"review_id":"i5UwUPlQFPLcE8p2gPFwBw","user_id":"WZXp9-V2dqRRJqhGgRqueA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2015-03-26","text":"For being fairly \"fast\" food.. Pei Wei (pronounced pay way I confirmed haha) is pretty darn good. we got a few things to share. I had the Asian chicken salad and was impressed! There was a decent amount of chicken. Some more veggies would be nice, but overall pretty good. The steak teriyaki was great as well as the fried rice. Over all good was good! Nice, clean, and reasonable.","useful":1,"funny":0,"cool":0}
{"review_id":"EyQyvTTg2jX4or9bB8PC9g","user_id":"XylT12exfdLiI_3uDLVIpw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2012-12-30","text":"I decided to try it out, I'm celiac and therefore can only eat gluten free...\nThey have an easy to understand GF Menu with anything you can possibly want.\n\nI placed my order online and picked the exact pickup time. I cam and my food was ready for me. Driving home the smell in my car was so good I could barely wait to get home and try it - true umami!\n\nI got home and dug into the delicious spicy chicken and rice with sugar snapies and carrots. It was superb! For $9 I will definitely try this again! I did see a huge line at the store, so try doing an online order and pickup forsure!\n\np.s. they even include GF soy sauce!","useful":2,"funny":1,"cool":1}
{"review_id":"G-EFA005besj5uHsH0sQFA","user_id":"Ji9PeffxjwqPLO7pEfSpKQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2009-01-12","text":"I'm not saying Pei Wei is the best asian food I've ever tasted, far from it, it's a fairly large chain that puts on the appearance of something more refined, it's essentially to Asian food what Olive Garden is to Italian Food.\n\nWith that said I've always had pretty good experiences with Pei Wei, the food although not spectacular is better than some of the overcooked chicken drowning in MSG offered by some of the local chinese restaurants.  the portions are good sized, the food is generally consistent, and the prices are really reasonable considering this is a corporate chain in some cases cheaper than the local establishments. or dare I say it's name \"panda express\" (which is overpriced crap)\n\nthe time before last that I went they forgot the tomato's and the dressing for an asian chopped chicken salad that my wife ordered, I didn't discover that the dressing was missing until I got home, I immediately called the restaurant and was speaking to a manager within 30 seconds. The manager apologized and asked me If I would like to come back to the restaurant or if he could have my address so he could send me a gift certificate. I decided to go back to the restaurant, when I got the restaurant I told the person at the counter my name and they already had a bag set aside for me, the manager came over and explained to me there was another full salad in the bag, and he put additional dressing for the salad we already had, and additionally he gave me a coupon for free lettuce wraps.(which mental note: I need to use)\n\nI must say I was impressed with this manager, and it was refreshing after being in situations where a manager has taken back the bag\/plate and essentially \"un-F$@k's\" your food and returns it to you.\n\nOverall great customer service, consistent food, and a good option for takeout in surprise.","useful":1,"funny":1,"cool":1}
{"review_id":"6PcJSGUBSLjt4VLXos5C4A","user_id":"TLIWzAJPrET0zX4_vgvLhg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2015-07-11","text":"Sometimes the food is spot on and delicious and other times it is quite salty at this location.  Very difficult to get a consistently good meal.  Menu items add up quickly.","useful":0,"funny":0,"cool":0}
{"review_id":"PFJmyZD_lNBa_Y3kbX1VvA","user_id":"JZEiTNWBwmv6MOOXYCAaMQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2015-05-27","text":"Decent customer service but the food was awful. It was cold and had no sauce at all. I was expecting it to be good but this place really went down hill. I will never eat here again.","useful":0,"funny":0,"cool":0}
{"review_id":"_Qv1FQUToLrKMuG6pV4Gzw","user_id":"E56sVQT5-OWfSejJrma8_w","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2015-02-28","text":"Super clean restaurant and friendly staff. FRESH food. Hasn't been sitting under heat lamps. NO MSG, this is the good stuff. I have to have the Kung Pao Chicken weekly.","useful":1,"funny":1,"cool":1}
{"review_id":"s2mlqrFNaPEGtcnEu3EJ4Q","user_id":"4WYICo4emecA9r7sPYQkBw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2010-04-05","text":"Found this the other night.  It is the PF Chang fast food option and it worked perfectly for us.  Limited menu, but lower prices. Very basic decor, but clean and fast seating.  Lettuce Wraps just as good as Chang's.  Very busy, especially the take out.  Glad to have it close","useful":0,"funny":0,"cool":0}
{"review_id":"oiSzZRrbi3y01_wqU528ZQ","user_id":"P8mVj7AZwJTFFH5FXbbmUg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2015-05-22","text":"The staff here is great and they're nice,  wonderful and quick. People were ranting in raving about pei wei, I had to try it.  Even good yelp reviews.  I'm highly dissatisfied with the flavor of the food. This  should be labeled Asian inspired and not Asian. I've tried a variety of Chinese restaurants, this doesn't taste close to anything I've had at other Asian restaurants. Their Mongolian beef  was 5 pieces of beef and large mushrooms cut into thirds in a thick sauce. You eat the rice to wash off the nasty flavor. My shrimp was thickly coated in an overpowering  sauce as well.  I only ate some of the veggies that take center stage on a meat dish.  The center of my pork egg roll was cold. The hot N sour soup was a much thicker consistency almost like that of a chili instead of being brothy. Worst of all was the price.  This was not worth it to us. Neither me or my husband enjoyed either of  our dishes.  We didn't even eat half of our plates.  We even refused to take it home with us.  If you like and enjoy what typical Asian food tastes like,  don't waste your time here.","useful":0,"funny":0,"cool":0}
{"review_id":"4BPjRE9VI0HhyZzyyYv0BQ","user_id":"7Y4NEBQqWg7j-TvrQi6UZQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2011-06-15","text":"I had the garlic ginger broccoli chicken and it was not very good. The broccoli was hardly cooked and the sauce was way to sweet. Everything else was great. I will give them a few more tries before I write them off as another crappy Asian restaurant in Surprise.","useful":1,"funny":0,"cool":0}
{"review_id":"kznHtw1Qido_9GX6sDQPJw","user_id":"vgZqQqe8cj6SBMH0EqDliw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2017-03-12","text":"This review is based upon consistency of flavor and great customer service.  We came and there was an unknown issue that required a 25 minute wait for food.  The employee notified us, and although hesitant, we decided to stay.  We have been here numerous times before in the past years so we are familiar with this location.  The employee was apologetic and gave us a free drink.  That was a simple gesture but rarely do you see decent customer service anymore.  We received our food and had an issue with an incorrect order.  It was explained and the issue was resolved quickly.  They gave us a free appetizer.  We do not expect perfection, nor free food.  This restaurant cares for customers and works to provide a positive experience.  We would return again because they have good food and they care.  That is a rarity in today's restaurant culture.  Kudos to the manager for creating this culture.  Ordered- fried rive and Tofu, edamame, won ton soup, dynamite chx, and Thai curry chx","useful":0,"funny":0,"cool":0}
{"review_id":"HWRTVn3Lc-RwN6udv4WJzQ","user_id":"O7G_c6wFXSygr82qs0GAcA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2016-12-19","text":"I love this place i'd recommend it to anyone ! We always order it togo and it never disappoints! The food always taste fresh and is always ready on time! Definitely our favorite lunch spot !","useful":1,"funny":0,"cool":1}
{"review_id":"GiEB_A-m9HuX521WQNbL8w","user_id":"UG4EKu13JRwzRix6ESINdg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2011-08-10","text":"1st! Place is not closed. There was an issue with legal workers in the franchise chain. Now they are back! Food is one of the best! Especially their chicken mango! Daughter is a huge PF Chang fan, so she loves this place also! Her favorite is their Mongolian beef, and noodles! They are always coming up with something new, so you may have to try them more then a few times.","useful":1,"funny":0,"cool":0}
{"review_id":"GKi4i6qocIgaYcwv1_0zzQ","user_id":"ZZG6yR27lIy3xwUYVgHO7w","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2013-06-17","text":"Definitely not a fan. Coming from Orange County, CA, I have high expectations when it comes to Asian food.  Suffice to say that Panda Express would have been a better choice, which is pretty sad.","useful":0,"funny":0,"cool":0}
{"review_id":"OrhWg2MmCznwfKfjHKvuhA","user_id":"1YorWW0Z-YDuYC5GplNabw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2015-11-03","text":"Pretty good, not great. Definitely overpriced. It's barely a step up from Panda and not worth the price difference. Not saying it was bad, but $25 for two basic dishes is a bit much and they didn't make the order how I requested.","useful":0,"funny":0,"cool":0}
{"review_id":"QXWku_OB3FCj9VCZfUZwwg","user_id":"ujOPJEz_KxzAyZDnji-2Ng","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2017-07-08","text":"I wish I could give 1.5 stars. Nothing special. Lack of flavor. The entrees were either sweet or spicy. The crab Rangoon were.....different. The filling had a mealy consistency. Friend rice was bland. Plenty of other places to spend 50$ on takeout. Save your money.","useful":0,"funny":0,"cool":0}
{"review_id":"5NtaW5EwXK595kP4Ynnisg","user_id":"6aEUn50d3Ts7MiGu6WdpKA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2015-09-22","text":"Disappointed that on yelp their hours show them open at 1030am but when you arrive they don't open until 11am. Waiting in the car to pick up a large order makes me think twice about catering from here. Don't get me wrong the food is great as always but they need to fix this.","useful":1,"funny":0,"cool":0}
{"review_id":"ai6O4UqqDqnjO7gfz6jBkA","user_id":"R6vb0FtmClhfwajs_AuusQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2012-10-08","text":"1st visit had the lo mein...delish!  \n2nd visit had the teriyaki...fine if you like salt.  Ick!","useful":0,"funny":0,"cool":0}
{"review_id":"ZrvsD7PSyPolII3gp4-uHw","user_id":"CPuUagT2rfUJm6hRgxn3JQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2015-12-28","text":"As a vegetarian, it can difficult to find places with good options, but I love getting a tofu bowl at Pei Wei. The first time I had it, I had to double check because it looks and has a similar texture to meat, but it's great. I love going to Pei Wei","useful":0,"funny":0,"cool":0}
{"review_id":"p7OqbXTjwmIN_XYohB6TFw","user_id":"OYRBjBWy1uOm12N3cokS_Q","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2009-11-18","text":"Typical big business chinese place. Slightly fancy but very average food. Kinda like a fast food place.... you walk up and order then get your own drinks etc. Portions are very small. Prices are higher than average.\n\nThey offer a few different vegetarian options but it all tastes pretty bad\n\ndo yourself a favor and also support a local business and eat at big buddha around the corner. Its much better food","useful":0,"funny":0,"cool":0}
{"review_id":"ukpjwnetF5wGhGrSXmPRwA","user_id":"PKZLwAGgBtQCjJtGhyPETA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2012-07-29","text":"I love Pei Wei since it's just a bit more affordable than PF Changs.\n\nThis is the first restaurant in the chain where I found patrons tipping the servers. Although I don't mind leaving a dollar when it's due I find it hard to do when they don't do very much, especially since it's more of a counter service experience.","useful":1,"funny":2,"cool":2}
{"review_id":"mT6U5lujK_zIcIqux92seA","user_id":"9bJ6j0zrV1XSiSnzQWM5Tw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2016-06-19","text":"Great fresh food and clean restaurant. Friendly and very accommodating staff. I'm a frequent visitor. This is a sister restaurant to PF Chang's, but without the formality or higher prices. Great place to eat if you want the same style foods as PF Chang's, but a more laid back environment without the need to dress up or spend more.","useful":1,"funny":0,"cool":0}
{"review_id":"YxAxExTdWtdMhEb14RGFRg","user_id":"8nCmV4RMwf4GpaN-A_2Tfw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2012-08-23","text":"This is pretty good. My wife and I usually split lettuce wraps and an entree of some sort. It's convenient to be able to order take out online. Overall, if I'm really in the mood for chinese food I'm going to make the drive a little further out to Big Buddha on Greenway and the 303, but this is a good substitute as it's about 1 minute from my house.","useful":0,"funny":0,"cool":0}
{"review_id":"ue6ts-gA9khywe76lEL1Kg","user_id":"tbAQMMVlhxvXhe6KifrZ-A","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2009-06-25","text":"Food is good and consistent and the service is always great. I've never dined in, but get take-out fairly often. I love being able to just say \"same as last time\" when I call it in. Not as good as PF Changs, but certainly better than most other Asian-ish places in Surprise. Be aware that they use shitake mushrooms is almost everything, but they are fine with custom orders if you don't want them. All in all, it's not my favorite place, but I always enjoy it every time.","useful":2,"funny":1,"cool":1}
{"review_id":"WsTYqsyNyUd7xpwFrgwI0g","user_id":"1s0Q1KwGpJIKvD-SRSpwjw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2008-10-06","text":"The hubs and I dined at the Glendale location about two years ago. i guess we were hoping it was like PF Chang's....but unfortunately were dissapointed.\n\nWe discovered the Surprise location a couple weeks ago and decided that tonight we would grab a quick bite. The hubs ordered Mongolian Beef (his fav at PF Chang's) and I ordered my \"tried and true\" Ginger Broccoli and Chicken.\" Of course we started with the Lettuce Wraps because honestly...they are just the most delicious things ever!\n\nTonight we were pleasantly suprised that the food was quite delicious. Although the dishes are EXACTLY like what you would get at PF Chang's they are scrumptous in their own right. The only downfall is that the noise isn't conducive to conversation.  I haven't been to an establishment this noisy since Buca de Beppo's...which I love (don't get me wrong)!  But I will say (on a positive note) that the customer service is fabulous! Something that can be hard to come by at times...\n\nAs for price....$28 bucks for the two of us including an appetizer, two entrees and two drinks. (coke and iced tea...with free refills) Seems a bit pricy to me but honestly....EVERYTHING is expensive now days. \n\nOverall, try it out...they offer take out too so you can enjoy great food in the comfort of your home....without all the noise! (or they have a patio you can dine from)","useful":0,"funny":0,"cool":0}
{"review_id":"g9yv-M3kvOQFPyJHCjUrdg","user_id":"-0kiduTUToVYFqN_NEqMSw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2015-03-17","text":"Very clean and staff is always friendly. I usually order the honey seared chicken but decided to switch it up. I ordered the Thai dynamite and it had a weird, almost chemical taste. I will go back but will stick to my usual order.","useful":2,"funny":1,"cool":1}
{"review_id":"fk8OI26dAhQfot46T_SXWg","user_id":"KrQ_dWOBn2voaQLNv7hj8A","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2014-04-22","text":"If I could give no stars I would. My family placed an order to be picked up and were told to be there at 7:20. We get there and I sit waiting for the food until 8! Nobody acted like it was a big deal when I told them and just said \"oh.... Well we are running behind.\" Um okay?! We get home and they forgot to put the crab puffs in my bag. Didn't bother going back and moved on to our meals. My honey glazed chicken was average, edible. My husbands sweet and sour chicken was so soggy it was disgusting! Couldn't even eat it. My daughter loves fried rice and wouldn't even eat hers, it was so greasy. We all ended up eating PB&J's and it was 100x better than anything we brought home.","useful":0,"funny":0,"cool":0}
{"review_id":"ld06EwR5YyutWxud9ude0Q","user_id":"2L_1kyJDOkEaPDiBRohx9w","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2016-05-07","text":"I went to Surprise Pei Wei Restuarant tonight on Bell.  This was my first visit to a Pei Wei.  I was very impressed with the atmosphere, food and staff.  The chicken teriyaki with fried rice was DELICIOUS.  The spring rolls were delicious too!  Your Pei Wei location is my new fav restaurant..","useful":0,"funny":0,"cool":0}
{"review_id":"CxVx2FD73kw--RuzXL_RVA","user_id":"xlkjaJUu2fVojeaaVgQPOw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2014-05-03","text":"I like Pei Wei overall and enjoy their varied menu selections.  The food is good and fresh.  Sometimes it's hard to find a place to sit though.","useful":1,"funny":0,"cool":1}
{"review_id":"jJaU6pbKkYgl15P-5zfg3A","user_id":"alTlRb9qMBX11pARX05Big","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2014-05-29","text":"Everything was good except Thai chicken wraps. Too much cilantro, absolute overkill. I think long stems is just yucky, cut them off!! Korean beef was ok but just missed the flavor I'm used to in this dish. Service is always spot on.","useful":0,"funny":1,"cool":1}
{"review_id":"7M2GCeIba1uTJMJbVO7TKw","user_id":"e--whH51bx5mDaMo3aJ-hg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2009-12-10","text":"I really don't understand how anyone can eat the food from here.  Granted, I am Chinese and enjoy authentic food, however I like good Chinese American food.  For someone who usually doesn't leave food on her plate unless it is really bad, I could not finish my meal because it was tasteless and below average.","useful":1,"funny":0,"cool":0}
{"review_id":"pxs5biP-IzmjXZpoh-iVHg","user_id":"Ns0hZ0xDOuVRMpHk0Q-5Yw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2014-10-01","text":"Went in for lunch with a coworker today. The small portions are overpriced and really aren't small-half would've been more than enough. \nWe were served quickly and the staff was friendly! The restaurant was clean and tables were bussed quickly. \nI was disappointed with my Mongolian chicken. It tasted more like Teriyaki and was swimming in sauce. I had at least a 1\/3 cup of sauce left on my plate after eating my food.\nAll in all, PeiWei's food will be why I don't return anytime soon even though their staff was excellent and so was the atmosphere.","useful":0,"funny":0,"cool":0}
{"review_id":"DW0B2tlav4Z7T1DTzAL7kQ","user_id":"SM20gx7YH0GtI5JOXhfXdg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2015-07-13","text":"The food is great and customer service is the best! The Dan Dan noodles are dynamite but they come standard pretty spicy...  I placed a pick up order by phone and asked for them to be mild, but they ended up being  spicy!  When I got home and tried to eat them they were too spicy.  I called in and spoke to the manager and he took care of it completely and replaced the order for me at no charge!","useful":1,"funny":0,"cool":0}
{"review_id":"nI2rhDM2CgNazMdhiODoRQ","user_id":"R-kL1bocHgP4GW7Mgd-ZXA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2016-02-14","text":"OH MY GOD, this place. I used to like Pei Wei until I moved to Surprise and this location ruined it for me. They consistently screw up on orders, have huge wait times, and run out of key ingredients on an alarmingly regular basis. We just spent an hour waiting for a take out order (kung pao veggies and vegetable fried rice), which was twice the time they quoted us, only to be told they were out of WHITE RICE (how does a chinese restaurant fail to foresee the possibility that they might serve a lot of white rice on a Saturday night?!). I may have chosen to stick around the extra 15 minutes if they hadn't already had to re-make half my order after making it incorrectly the first time. When I change up an order even slightly to accommodate for allergies\/dietary needs, they have to re-make it at least 75% of the time.\nIf the food was consistently delicious, I'd rate it higher, but honestly, it's only okay.","useful":0,"funny":0,"cool":0}
{"review_id":"sb7iYaCc6ggpShtElkcwiw","user_id":"6jz_Yr6_AP2WWLbj9gGDpA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2015-02-12","text":"My wife wanted to try this place for awhile now.  One of her brothers friends used to be a manager of one in Colorado too.  Tonight we decided to try it out.\n\nI placed my order online.  Easy process.  My wife went with an order of Chicken Lo Mein and I went with Sesame Chicken\/Steak with fried rice as well as an egg roll and 2 pot stickers.  Total for everything was $24.80 after tax.  I drove down and picked up my food.  The manager their was friendly, rang me up real quick and I was out the door in no time. This bag was heavy as hell too!   Here is how everything tasted.....................\n\nChicken Lo Mein-  Only had a little of this.  Good noodles, good white meat chicken.  My wife liked it.\n\nSesame Chicken\/Steak-  I decided to try out 2 kinds of meat.  They let you mix and match which is cool...they charge you for the highest priced item.  I substituted fried rice for white rice (.99 cents extra).  This was touted as soy citrus glaze, red bell peppers, onions, scallions, ginger, garlic and chile paste and sesame seeds.  It was just alright.  The flavors didn't really do much for me.  It was a tad spicy from the chile paste but overall it was kind of bland.  I had some pieces of steak\/chicken that were a bit funky too.  I would definitely try out a different dish next time here...if there is a next time ;-).  The fried rice was good!\n\nEgg Roll- Eh.  It was an egg roll.  Nothing fantastic about it but it tasted fine.  It came with a sweet mustard dipping sauce which was pretty tasty.  Usual fillings of pork, veggies etc.\n\nDeep Fried Pot Stickers-  I got 2 of these things.  They were good.  Small but good.  Straight pork filling in the middle of them.  \n\nOverall it was just alright.  I will say that they give you a GRIP of food.  The 2 entrees we got could have easily fed 1-2 more people.  For $24.80 it was a great value.  The food just wasn't the type of thing that  you would ever crave and keep you coming back though.  While I was eating my meal, all I could think of were better Chinese food places I have had before....wishing I was eating them instead.  It filled my belly, service was friendly and the value is definitely there.  I'll probably give them another try and order some other dishes to see if there is something I really like.  We shall see............","useful":7,"funny":5,"cool":6}
{"review_id":"j51qEbi4hMm6WHGlkt57xg","user_id":"UXZDRVdx8eJqdqb13Bcfcg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2009-01-24","text":"Haven't eaten at this location in particular, but in general the prices are high for what you get.  It's nothing special and any other Chinese place in the city can probably beat it in the price\/quality area.","useful":1,"funny":0,"cool":0}
{"review_id":"fKCizCcgm5lrdh0fxnOplg","user_id":"EKTCccgwn9MAIDNSsDwuIg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2014-08-28","text":"Always on point. I get the Carmel chicken.. The crab wontons are a guilt must have. And I love there  tea too. Ate her for two years and always pleased. Thx!","useful":1,"funny":0,"cool":0}
{"review_id":"TGG8n3Cb3klpPdamJ88owA","user_id":"rHP3q9Ok1qu9_tJmIy4i9w","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2015-11-01","text":"I love Pei Wei. The food is delicious. The atmosphere is chill. The restaurant was clean and staff friendly.","useful":0,"funny":0,"cool":0}
{"review_id":"hQCBUqXmVB2QuQ2MVv3Apg","user_id":"bwElUOvj3cIjMp2qp4vjeQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2010-01-10","text":"Came here with my friend today cause we were starving and decide to go whichever next place we saw. And we were very surprised at how pretty the inside of the restaurant looked. The decor was amazing. I ordered the Japanese teryaki bowl vegetarian style and it was amazing. I loved the tofu and the brown rice and the veggies. My friend ordered the lo mein and she loved it. We didn't finish due to the fact that the portions are huge. (we didn't know it was a like share the bowl type of place, and when we figured it out we didn't do it because hers had meat). But overall this place was amazing. The employees are very very nice! And this place is vivid and just amazing. WAY better than panda express. I will definately come here again, and recomend it to everyone!!!","useful":0,"funny":0,"cool":0}
{"review_id":"P8h9lk3qwwzaYgM4ueCeqA","user_id":"C38sl6tI_DVrpL5sg4Kmfw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2010-07-04","text":"Very consistent food. Definitely a second best to P.F. Chang's.","useful":1,"funny":0,"cool":0}
{"review_id":"LP1OdCHa7DMVpbLhB4dgMg","user_id":"cs6biPoaG9SmtVB44hU9Sw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2015-10-29","text":"Service is fast and on time. Love the online ordering-very convenient!  Food is always hot and delicious. However...NO FORKS FOR TAKE OUT?  That is poor management. Either you didn't order in time or there was a problem with the order...either way, hustle your booty to Walmart and buy a couple boxes: Unacceptable!","useful":2,"funny":1,"cool":0}
{"review_id":"_laP3dAOE--w6JMCG4HFjg","user_id":"1fMDrDfB3IHPCka9SeSHsA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2013-06-21","text":"The food was fantastic! I highly recommend  the lettuce wraps.","useful":0,"funny":0,"cool":0}
{"review_id":"RMuW5m75o_5RgL2mTMfg2g","user_id":"zLt0Qu_98ZGObYBTcG7jRQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2010-07-02","text":"Then we went to dinner at Pei Wei. Not bad for an Asian fusion place. Filled with senior citizens, but that's not all that surprising. I had the Mango Thai Shrimp, apparently, which was good. Right amount of spice in the dish. Not too heavy, either. Steve and Chris had their own plates as well, both of which looked appetizing. Not crazy about the moderate wait nor the fact that strangers came up to the table with unnecessary parenting advice for Steve and Chris.","useful":2,"funny":1,"cool":1}
{"review_id":"9-mx4vAByTMxJDrLfNZZbA","user_id":"33h6CGtB9MSYHi0-kbXMhw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2012-09-11","text":"We use them to cater family get-togethers. Love the vegetarian dishes, especially the baked tofu- yum!  The Mongolian beef is a favorite with family.  When we dine in we always get the lettuce wrap.","useful":0,"funny":0,"cool":0}
{"review_id":"FxAxYxj5SbiOtcK36bJxCA","user_id":"mCE5jUDzP-ihU_6cwQsiiw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2011-02-27","text":"We went as a family of 6 and was treated very poorly by the manager at the  place. The food was greasy (I guess most Americans would love it since they don't see the difference) The manager had the audacity to compare this restaurant with PF Chang which is equally greasy and bad. I wouldn't recommend this place to any health conscious people. To top it all its expensive. Go to taco bell or China Panda and save your frustration and your appetite. Just being fancy is not the attraction motto for me. Maybe they will train their managers to change the attire of the restaurant. I wont waste my time here.","useful":0,"funny":0,"cool":0}
{"review_id":"0sRld5Hk0O6JUGKpPlWgPQ","user_id":"gRhtEXoxVpaccgvr3OkC0A","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2016-05-31","text":"I love their food. I have gone there multiple times and still think it's great. I especially love their soda machine.  The Mongolian Beef dish is my absolute favorite.","useful":0,"funny":0,"cool":0}
{"review_id":"g9IdtJr5oVv4Df0nY_IPng","user_id":"ljGTQD_-yC4iXievtgCsbA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2015-01-21","text":"We are winter residents and always look forward to eating here when we return.  Sorry to say we were quite disappointed with our Pad Thai orders today, so much sauce that it resembled a thick soup.  The egg ingredient seemed to be overlooked and was in big slices rather than smaller curds,  when I asked a server about the sauce he replied that it wasn't really sauce but that the rice noodles were too wet.  Either way, it was not a pleasant dish today.","useful":2,"funny":1,"cool":1}
{"review_id":"i_g131Z2mXHBSSm5erJZbw","user_id":"faaOI6hU64h6SSaF0f11eg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2009-10-06","text":"Very tasty Chinese food!  The prices are reasonable and serving sizes are generous.  I really enjoyed the Mongolian Beef!\n\nDont forget to grab a fortune cookie from the bowl on your way out!","useful":1,"funny":0,"cool":0}
{"review_id":"pta_2pIbHJhx_XM1-rIHzw","user_id":"d6om2E23bPoZFWzLss-rrA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2010-10-04","text":"All around great flavor and portions. Perfect for take-out always consistent the fam eats here about three times a month never had a bad meal.","useful":0,"funny":0,"cool":0}
{"review_id":"Ty2JjQqEZrmbSO7eFwlyiA","user_id":"O2U5kLpXDY-xjDppJ7d_Nw","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2008-12-02","text":"The vegetarian options are pretty good, especially if you like tofu. The restaurant was out of napkins the last time I was there and the staff was friendly. I would recommend the take-out option versus dining in though.","useful":0,"funny":0,"cool":0}
{"review_id":"hZsxP7BZi8seJQRKw6hxEQ","user_id":"5zkRD7dv8GqysVCvwPr-Ew","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2016-02-13","text":"Pretty good food a chain. You do get a lot of food for the price. However, every time I have ordered online there has been a mistake. Sometimes they tell me they never even received my order when I received the confirmation email. Also, if you in during a busy time and have a teenage girl as a cashier, you're chances of having a pleasant experience with her are slim to none. This has happened to me multiple times with multiple different cashiers. I have spoken to the manager and he is always very apologetic, but I guess you just can't get stressed teenage girls to be nice to customers. I will continue to go here as the food is good for the price and they are relatively quick with preparation. Nice options if you're veggies as well.","useful":0,"funny":0,"cool":0}
{"review_id":"1GVnTlLTCeR6Ew8z2D1EFw","user_id":"Ov-0pRQxz5fTTElFE-WtTQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2012-07-08","text":"What can I say, I'm a sucker for Pei Wei.  When we lived in California, I heard the place was shut down.  Glad to move back and see it open.  \n\nTake out rocks, call ahead.  They remember your phone number and name, so when you call they already know you.  They also save your last order to ask if you want the same, or to add anything to it... Nice touch.  I think I eat there too much! \n\nThe only thing I don't like, and I think I'm the only one who doesn't like it, is the soda machine.  Only because I always get a soda after someone has pumped out some nasty combination of orange soda and root beer, then I can taste it in my coke.  Wish they had some filter system.  Otherwise, I could eat here daily.  Find me here at least once a week! :)","useful":2,"funny":1,"cool":1}
{"review_id":"lHZziOQQYBGuyx11nCGSnA","user_id":"QZmG0pJlPQUq0PudwDKI5g","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2013-05-23","text":"Took the family there last week.  Ordered fried wontons, sweet and sour beef, Mongolian beef, honey crusted chicken and pad Thai noodles.  \n\nThe Mongolian beef was delicious, however the white rice was undercooked, some of the rice was hard still and crunchy.\n\nHoney crusted chicken also quite good, same story with the rice.  Same thing with the sweet and sour beef.\n\nOrdered the Pad Thai without peanuts... Son is allergic to peanuts so we made it very clear we didn't want anything with nuts.  They deliver the pad Thai with peanuts all over the top.  Sent it back and they fixed it.\n\nThey brought us spring rolls which we did not order.  We said they were not ours we ordered wontons.  They bring us the wontons a few minutes later.  The wontons are less expensive than the spring rolls, we point that our to the guy at the register and with a bit of smart-alecky-ness says that he \"let us keep the spring rolls\" and \"didn't charge is for all of our drinks\" as if he did us a favor.\n\nOverall the food was decent, the rice was terrible and the attitude of the cashier was not what I expected with a $65 food order!!\n\nI wouldn't go back for that price and food quality but perhaps we caught them on a bad day..","useful":0,"funny":0,"cool":0}
{"review_id":"hUnVNj83RehIogPzxKkR9w","user_id":"iSWxqsVgkzn_I3t5pAw66w","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2017-04-07","text":"I love the food and the containers it comes in. We eat there sometimes and also carry out. My favorite is ginger beef broccoli! Thank you for the emails especially. I really appreciate it","useful":0,"funny":0,"cool":0}
{"review_id":"wmoivnocytzFnsJaB-5RIA","user_id":"DAIpUGIsY71noX0wNuc27w","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2016-03-17","text":"Pei Wei has become a favorite \"take out\" spot for both myself and my girl friend.  We drive a little further than the local Taco Bell - KFC combination fast food stop, but to eat healthier it is certainly worth our time. \n\nYesterday, after our Silver Crafting Class, we drove the 2.4 miles and not only enjoyed a relaxing healthy lunch, but then purchased \"take home\" orders so we would have our evening meal in the refrigerator waiting.  (I brought my husband home an order of his favorite Kung Po Chicken with brown rice.)  \n\nIf you haven't give Pei Wei a try, stop in some time. I believe you'll enjoy it -- that is, IF, you enjoy Asian dishes.","useful":0,"funny":0,"cool":0}
{"review_id":"ZUKo5tY7ZXqzF8-Uu0R8Rw","user_id":"t9lwePmlZ7Sl_wiw9SFSrQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2015-08-08","text":"It's just above average.  Portions are decent and cost was ok.  Got in and out fast by phoning our order in.  Good was ok, it didn't floor me but it didn't make me not want to there again.","useful":0,"funny":0,"cool":0}
{"review_id":"l8cGGc6AaHCj8XomkYRzAw","user_id":"p_azadim_uWFOXAhhKB3ag","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2008-11-27","text":"In Surprise this is probably the best Chinese offering which isnt saying a whole lot. I really wish there was an awesome offering out there in terms of Chinese food.. Mexican food, oh yeah, some very good places mostly but Asian, youre better off staying at home and cooking. \n\nWe ordered the Asian Chicken Salad, chicken was old and had that old gross fridge taste.. Dan Dan Noodle, the noodles were over cooked and stuck together as one large soggy noodle.. Curry with Tofu, the curry had a weird perfume taste.. the honey chicken was pretty good as well as the hot and sour soup though neither made for good leftovers. \n\nWith Surprise having so many chains it wasnt surprising to see one of these finally opening up.. a far better choice than Panda Express.. kind of sad, huh?","useful":8,"funny":4,"cool":6}
{"review_id":"kAA5n5ie00OFi0w0K53WSA","user_id":"GG9tAoEC9sMa_DokSkkImA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":3,"date":"2017-06-10","text":"Pei Wei is the fast food version of PF Changs. There's a long and interesting story surrounding Pei Wei and that of PF Changs. Let me just say that, a man named Paul Fleming (PF) and (Flemings) is responsible for many of the restaurants that you and I frequent. His ex wife and him went through a bitter divorce her nickname is (Flow) and she operates \"Flows,\" Chinese restaurants. Flow is Chinese and married another Caucasian man 20-25 years younger than her, who speaks fluent Chinese. Anyways, Peiwei's in my opinion is overpriced for the small amount of you receive for the consideration you give. In other words, there's no value for your consideration. Yes, I do enjoy the PeiWei Spicy chicken, extra spicy with water chestnuts, but at $12.53 for the water chestnuts and extra chicken, it's just not worth it. The rice is almost always dry and is cooked incorrectly in massive amounts, as well as being a long grain, not short grain rice. NOT WORTH THE MONEY!!!","useful":5,"funny":1,"cool":3}
{"review_id":"k53Lj6HucbPbqZWYNFoBsg","user_id":"cPfnF9PAvVjamEdZM3wTzA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2013-04-26","text":"I love the lettuce wraps here. They are simply the best.  I order carry out often from here. I occasionally dine in.  My problem with the dinning in is the seating. It is always difficult to find a seat.  The place really needs to expand.  If you have a party of more than 4 most days you can hang it up.  Other than the seating I like it. Large portions of rice and noodles.  A little stingy on the meat.","useful":0,"funny":0,"cool":0}
{"review_id":"ULJhNKA4iikk9fVyvfPHqA","user_id":"MFKjHdwguK0kDzNteF07_A","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2014-12-27","text":"Just dirty ... Sometimes I wonder why we come back here. At the register the girl handed me a cup. There was particles of food on the inside. I handed it back and said \"It's dirty, I'll take a different one.\" She put the dirty cup back with the other 'clean' cups. I stopped and restated \"No. It's DIRTY, you probably shouldn't give it to someone else.\" (Shaking my head)","useful":2,"funny":0,"cool":0}
{"review_id":"En6K7NF2Sqxjc3NKLjx0cw","user_id":"e3S63222bmnlIYLi2DCeQg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2017-04-23","text":"Hot,vegan,carbo load \nYou name it and they have it\nPricing is reasonable  and quality excellent \nNo disappointments here\nFive stars for the food \nWe try to stop by monthly","useful":0,"funny":0,"cool":0}
{"review_id":"uiSS0Hd9L4krCvwX0jMugg","user_id":"GjxM-LmQcta13_DiUniVgg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2016-03-02","text":"I eat regularly (3-5 times a month) at Pei Wei, usually in Scottsdale or North Phoenix. My wife's doctor is across the street from this Pei Wei, so we have been stopping in when we go to her baby check ups. It is, without a doubt, the best Pei Wei I have eaten at. It is consistent, they don't get frustrated if you customize your order, and the cooks on always on point. \n\nWish this location was closer!","useful":0,"funny":0,"cool":0}
{"review_id":"z30Tv_MrQzEow6WjLFmtXQ","user_id":"C_DEhSnhqFbtJcPb39FALA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2017-06-12","text":"This Pei Wei location has such kind, welcoming staff. They are so accommodating and hospitable. 5 stars, hands down.","useful":0,"funny":0,"cool":0}
{"review_id":"EvlwP4hCwnFdQyUvC6RFVQ","user_id":"wsDiT-IGGM8tvlaMwf1zwQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2009-01-19","text":"Pei Wei is a fast, easy, cheaper PF Chang's - and that's what makes it great! If you like the tofu dishes at PF Chang's, you'll love Pei Wei. The food here is great. The service is exceptional. And the portions are huge! I usually end up taking about half the food home with me. Also, compared to other lunch spots near by (like Paradise Bakery), it's really not all that busy. Of course, it's not authentic Asian food, but you shouldn't be expecting that when you come here anyway.","useful":0,"funny":0,"cool":0}
{"review_id":"mgNBEZoEznL5VYGAUmyAWQ","user_id":"LSNwKpMPDsTjaAZEq5ud2Q","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2010-12-29","text":"The problem may be that I lived in the Bay Area for 30 years. There, bad restaurants expire in less that a year.  Pei Wei wouldn't last very long.  We had the Mongolian Beef and Kung Pao chicken.  The beef was in a salty, sticky sweet brown sauce that rendered it almost inedible.  The Chicken had little spice or sauce, although the pea pods were fresh.  Think Panda Express. Food is not serve family style. Food is ordered at the register and brought (eventually) to your table.","useful":2,"funny":0,"cool":0}
{"review_id":"UQ68U4Z2JAhuBMOrAv1AGA","user_id":"d5xWk1GosWpEP7pGfLzh9g","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2016-08-28","text":"First time ever giving a review but felt it was necessary. I'm just gonna go all in and say it... Pei Wei sucks ass. It seems to be subjective, I know. But in comparison to legitimate Asian food, wheather that's credible Thai, Chinese, Vietnamese, etc., I'm not sure how anyone can make a compelling argument that Pei Wei is \"good\" food.. The crab wontons are usually a sure bet at any Asian restaurant but for some reason it just always sucks ass here. Fishy weird taste that's contrary to what they should taste like and the sauce is garbage. Teriyaki Chicken was bland and shitty. Pei Wei Spicy dish was average at best only cuz of the sweet sugary sauce that masks the overall flavor. Now my girlfriend and I just feel like shit.. Why? Cuz it's shitty food. Also saw on the local news that the location on Glendale and 7th st. had 4 health code violations. I'm officially done with this place. Spend a couple extra bucks and go eat some authentic Asian cuisine at a family owned restaurant that actually knows how to cook real food.. Not some corporate food chain bullshit.. Thank you for reading and bless your heart.","useful":0,"funny":0,"cool":0}
{"review_id":"wFP3lpVdl03_NxZoXL4Pzg","user_id":"F783ardridpj3owUMHg-Fg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":2,"date":"2015-11-07","text":"The wait time for the food was way too long- 30 minutes for a bowl of spicy noodles with some veggies. I'm a guest from out of state but this is nothing better than my local Panda joint. They should probably let the customers cook the food cause we could do it faster. \nThe food was okay but the portions were a bit big. While I was waiting for the food (+30 min) I noticed a lot of people just ate a few bites and left the food on the table. So much food wasted- there must be a reason for that right?? \nThe bathrooms weren't clean, barely had soap no towels and toilet didn't even flush!! \nI hope next time I'm down here that it isn't this bad.","useful":0,"funny":0,"cool":0}
{"review_id":"0udTI0_Iy32PVH5ASUjfpA","user_id":"hxhKA0q9jLxTfUdg1LM9Bg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2010-11-19","text":"I ordered the teriyaki bowl and it was great food for the price.  Quite impressed by the variety of options on the menu. Not sure if this location was the one I tried.","useful":1,"funny":0,"cool":0}
{"review_id":"ylXGqKJWJkwCwO-mhKh12A","user_id":"IFBx9nPxyomWzj_2prR6bg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2015-03-15","text":"Absolutely wonderful. This place is clean, the staff is wonderful and go out of their way to help you. They stay a step ahead of you and get what what you need. \n\nThe food is perfect! I have eaten here many many times and it has always been fresh, hot, and delicious! I highly recommend this place, 100%!","useful":0,"funny":0,"cool":0}
{"review_id":"mUgMtcicQR39CJX9FCchTg","user_id":"RhDwmkLWmC1SGF0VPV7xYQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":4,"date":"2011-09-15","text":"Service is a 4  . Very sloppy also the hot and sour soup aint that  bad if u add enough chile paste and salt and soy sauce the gentleman named pop he is the manager great service from him and this other lady did not get her name unfortunetly  I've changed my rating 2 times that's how impressed I am","useful":0,"funny":0,"cool":0}
{"review_id":"nsUHkKb3vIdwd0x7egzBUQ","user_id":"CnSzFGho_Ofsda3DOg0cIA","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2014-10-27","text":"Love the food but it's great at all locations. The customer service is horrible at this location. Only two tables were occupied at the time we walked in for a carry out. We walked in and they looked at us like.....really? Go away!! Someone walked up to the register and he just looked at me. I asked him if he was ready to take my order and he just kept looking at me like I was wasting his time.  No thank you, nothing. Just a hand to take my money and then a bag in my face so I would leave and get out of their faces. Really???","useful":0,"funny":0,"cool":0}
{"review_id":"M6qZU16SjXoyoLrmNENhQg","user_id":"kq0emTsKE2DcDOWbe1NYRg","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":5,"date":"2017-03-06","text":"We are from the Midwest and are visiting Phoenix on a vacation. We stopped in this place for some quick Asian food. What a great surprise! I had the Mongolian chicken and it was great. Very similar to PF Chang. You order at the counter and they bring the food. I wish we had one of these where I live.","useful":0,"funny":0,"cool":0}
{"review_id":"Wjcm9kzfQp3d2R6uqblzzg","user_id":"mIGfb8yh-zSOoh0U2Y8mSQ","business_id":"jQsNFOzDpxPmOurSWCg1vQ","stars":1,"date":"2017-01-24","text":"I usually go to pei wei regularly and am usually over all satisfied.  However today did not go well . First I was unable to order online,   when I  went to pick up the food I brought  a gift card with a remaining credit on it and the remaining total written on top with a permanent marker which would have covered the entire cost of my meal. When I handed it over to the employee  she swiped the card and simply stated there is a zero balance on this card. To which I replied that can't be correct because the last time I used it the employee wrote the available balance on the top of the card for me. The cashier didn't seem to take me serious and simply asked for another method of payment. I was in a rush it was my lunch hour so  I paid out of pocket. \nThe sauce on my food taste watered down over all a poor experience. To add insult to injury I later called the number on my gift card and they assured me that I did have a credit balance which leave's me wondering what are gift card's good for? \nBUYER BEWARE...","useful":1,"funny":0,"cool":0}
{"review_id":"4RF8dMNBW-p2eTluPME_4g","user_id":"rv6_U_4AsOQ-L50aNRuNNg","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2011-08-21","text":"Enjoyed the bright fun Mexican decor!  The food was delicious and reasonably priced!  And the margaritas were delicious!","useful":0,"funny":0,"cool":0}
{"review_id":"ClgrKJ6dqiM7vSKJBJ2w6Q","user_id":"T5MGS0NHBCWgofZ6Q6Btng","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2013-06-03","text":"I've been here at least 5 times now and each time is better than the last. I Iove what they have done to improve the building and add outdoor dining. Service is always good here and on par with other top places in Mentor. I really suggest the chicken soup on a cold day it's very yummy! Everything I've had on the menu has been great.","useful":0,"funny":0,"cool":0}
{"review_id":"IBCTqmvwvd5ZqQhuvFDNXg","user_id":"NtkMuGqcis30GjAkq91etA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2014-03-15","text":"Terrific service. The place was packed, but we were seated right away. Chips and salsa on the table as we were seated. Great food, big portions, fast service.","useful":0,"funny":0,"cool":0}
{"review_id":"69kni-xG6qtg9y3Hq_zw5g","user_id":"unEY79t6hHECP9Yd58R1dg","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2014-06-09","text":"Ate here for lunch on a Sunday.  Arrived around 12:30, and there were a decent number of customers seated.\n\nService was friendly and fast, food was excellent, and they have DRAFT BEER, including a couple of Mexican brews.\n\nThis location is the best Don Tequila I have been to.","useful":0,"funny":0,"cool":0}
{"review_id":"rQOasxLFCDNWLNW27VHnyA","user_id":"UwfgmOOul1fc79IcI5h2MQ","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2012-02-25","text":"Been dining here since it first opened. Wife is from tx so this is her taste of home. When tx folks come to visit they ask to go to Don's. \nIt's very good tex-mex.","useful":0,"funny":0,"cool":0}
{"review_id":"eGtRHSII_uNGVELSxjYNSA","user_id":"kqsBiDRm1u34Q0RqN62QIA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2014-03-15","text":"If you have a hankering for Mexican, head on over to don tequilas. Fast service and delicious food with generous portions. We ordered the Guadalajara special tamale and the pollo adobe and they were both delicious.","useful":0,"funny":0,"cool":0}
{"review_id":"O5UfgCBj4osaEeolc_muUA","user_id":"BYgAy3hu2s5GeiJ5WMuD0w","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2011-06-14","text":"Kind of disappointed with the previous reviews in the area of customer service because honestly there was none. We were the only patrons in the restaurant and the waiter seemed  inconvenienced by us being there. After he took our order he went and sat down in another booth and started playing on a computer. We did not get our food quickly like everyone else has said, as we were the only people here it shouldn't take as long as it takes for me to finish my beverage. Maybe it had something to do with the fact that the waiter was farting around instead of doing his job? They got three stars because despite the service the food was AMAZING and quite inexpensive. If you order a quesadilla you may want to order a la carte items as well because the quesadilla was the size of a large Taco which is odd.","useful":0,"funny":0,"cool":0}
{"review_id":"Dq7iR4uVsVWPfqKqaLtmtw","user_id":"iIZhrDYOmcyGdiWSWAldmw","business_id":"dwQEZBFen2GdihLLfWeexA","stars":5,"date":"2013-04-24","text":"I eat here all the time and most of the staff are from Guadalajara.... Food is definately \"americanized\" and by that i mean tamed down in heat and changed a little for what americans expect.... But when i order my racos de carne asada with lime and cilantro and onions.... All i get are big smiles and HOT sauce.... So if your in the mood for authentic hotmexican food.... Just let the waiter know.. Hell guide you to a great choice!","useful":0,"funny":0,"cool":0}
{"review_id":"H4ecwTdoO_sjwELf62BjwQ","user_id":"tV0N0henYG4krjjA7glZhA","business_id":"dwQEZBFen2GdihLLfWeexA","stars":3,"date":"2017-07-01","text":"Inconsistent service, average food.....I've had better at Chipotle.....\n\nWon't be back.","useful":0,"funny":0,"cool":0}
{"review_id":"0IOu6FA2x-rcvtXb8Xvheg","user_id":"Rt1sD4KdPD6Uquf9BIsw2Q","business_id":"dwQEZBFen2GdihLLfWeexA","stars":1,"date":"2012-12-10","text":"Always the same old bad Mexican food. At least this time I did not get the nearly 2 foot piece of hair in my Fajita Burrito.\nWhy many people I know, including my wife like to go to this place is beyond me.","useful":0,"funny":0,"cool":0}
{"review_id":"ysv7Ynllze9TV3GkzF0D3g","user_id":"xU3FI_O1XrjGRzOiFWvjBw","business_id":"dwQEZBFen2GdihLLfWeexA","stars":4,"date":"2015-09-07","text":"Very good, reasonable priced . The Texas quesadilla with chicken, \nSteak, shrimp, onion, peppers and cheese was large and very good\nThey have Dos Equis on draft!","useful":0,"funny":0,"cool":0}
